Tekla.Structures.ModelInternal.dotComponentAttribute_t
Struct for the ComponentAttribute.

Tekla.Structures.ModelInternal.dotComponentAttribute_t.aName
Name of the attribute

Tekla.Structures.ModelInternal.dotComponentAttribute_t.AttributeType
Type of the attribute, int, double or string

Tekla.Structures.ModelInternal.dotComponentAttribute_t.IValue
int value

Tekla.Structures.ModelInternal.dotComponentAttribute_t.DValue
double value

Tekla.Structures.ModelInternal.dotComponentAttribute_t.aStrValue
string value